import { setLocale } from "yup";

setLocale({
  mixed: {
    required: "این فیلد الزامی است",
    default: "مقدار نامعتبر است",
    oneOf: "مقدار باید یکی از گزینه های مجاز باشد.",
    notOneOf: "مقدار نباید یکی از گزینه های محدود شده باشد.",
    defined: "این فیلد باید مقدار داشته باشد.",
  },

  string: {
    length: ({ length }) => `باید دقیقاً ${length} کاراکتر باشد.`,
    min: ({ min }) => `باید حداقل ${min} کاراکتر باشد.`,
    max: ({ max }) => `باید حداکثر ${max} کاراکتر باشد.`,
    matches: "فرمت وارد شده صحیح نیست.",
    email: "ایمیل وارد شده معتبر نیست.",
    url: "آدرس وارد شده معتبر نیست.",
    uuid: "شناسه UUID معتبر نیست.",
    trim: "این فیلد نباید فاصله اضافی در ابتدا یا انتها داشته باشد.",
    lowercase: "باید فقط حروف کوچک استفاده شود.",
    uppercas: "باید فقط حروف بزرگ استفاده شود.",
  },

  number: {
    min: ({ min }) => `مقدار باید برابر یا بیشتر از ${min} باشد.`,
    max: ({ max }) => `مقدار باید برابر یا کمتر از ${max} باشد.`,
    lessThan: ({ less }) => `مقدار باید کمتر از ${less} باشد.`,
    moreThan: ({ more }) => `مقدار باید بیشتر از ${more} باشد.`,
    positive: "عدد باید مثبت باشد.",
    negative: "عدد باید منفی باشد.",
    intege: "عدد باید صحیح باشد.",
  },

  date: {
    min: ({ min }) => `تاریخ باید بعد از ${min} باشد.`,
    max: ({ max }) => `تاریخ باید قبل از ${max} باشد.`,
  },

  boolean: {
    isValue: "مقدار باید درست یا نادرست باشد.",
  },

  object: {
    noUnknown: "این فیلد شامل مقادیر ناشناخته است.",
  },

  array: {
    min: ({ min }) => `حداقل باید ${min} مورد وارد شود.`,
    max: ({ max }) => `حداکثر می‌تواند ${max} مورد وارد شود.`,
    length: ({ length }) => `باید دقیقاً ${length} مورد وارد شود.`,
  },
});
